import random

User1 = ("Бережнова Марина Юрьевна", "+79888944424", "Г. Ростов-на-Дону, проспект 40-я Победы, д.97 кв. 82", "344111",
         "https://vk.com/id141560148")
User2 = ("Фоминская Нелли Леонидовна", "+79132443911",
         "Алтайский край, Бийский район, Г. Бийск, ул. Владимира Мартьянова, д.51, кв 214", "659305",
         "https://vk.com/nellifoma")
User3 = ("Сипко Виктория Евгеньевна", "+79507994869", "Г. Омск, ул. 20 лет РККА, д.9 к.6, кв. 16", "644001",
         "https://vk.me/viktoria_s_e")
User4 = ("Толмачёва Виктория Александровна", "+79089534308",
         "Кемеровская обл., Г. Кемерово, ул. Авроры, д.6 (отправлять СДЭКом)", "650002", "https://vk.com/vikavisual")
User5 = ("Гусева Ирина Михайловна", "+79807023639", "Ярославская обл. Г. Тутаев, ул.Дементьева, д.6, кв.28", "152300",
         "https://vk.com/frezigate")
User6 = (
    "Каверина Ксения Владиславовна", "+79822813346",
    "Челябинская обл., п.Западный, мкр.Привилегия, ул.Уютная, д.27, кв.30",
    "456509", "https://vk.com/id22710763")
User7 = ("Супонькина Татьяна Алексеевна", "+79016664504", "Иркутская обл., г.Тулун, ул.Ползунова, д.57", "665254",
         "https://vk.com/id86710272")

array_users = [User1, User2, User3, User4, User5, User6, User7]


def find_name(number):
    for i in range(0, len(array_users)):
        if number == array_users[i][1][1:]:
            print(f"Опа номера {number} и {array_users[i][1][1:]} равны")
            print(f"Длинна {len(array_users)}")
            return array_users.pop(i)
